In [2]:
#creating a dictionary
person = {
    'first' : 'Nate',
    'last'  : 'Furry',
    'email' : 'dennisbija@gmail.com'
}

In [3]:
person = {
    'first' : ['Nate'],
    'last'  : ['Furry'],
    'email' : ['dennisbija@gmail.com'],
}

In [4]:
#creating a list of friends with email
people = {
    'first' : ['Nate','Mike','Alfred'],
    'last'  : ['Furry','Francis','Kiky'],
    'email' : ['dennisbija@gmail.com','mikefrancis@gmail.com','alfredkiky@gmail.com']
}

In [5]:
#acessing all the email
people['email']

['dennisbija@gmail.com', 'mikefrancis@gmail.com', 'alfredkiky@gmail.com']

In [6]:
# importing pandas library
import pandas as pd

In [7]:
#turning the dictionary to data frame
df = pd.DataFrame(people)

In [8]:
#calling the data frame
df

    first     last                  email
0    Nate    Furry   dennisbija@gmail.com
1    Mike  Francis  mikefrancis@gmail.com
2  Alfred     Kiky   alfredkiky@gmail.com

In [9]:
#acessing all the rows from the email column
df['email']

0     dennisbija@gmail.com
1    mikefrancis@gmail.com
2     alfredkiky@gmail.com
Name: email, dtype: object

In [10]:
#checking the specification of the email
type(df['email'])

pandas.core.series.Series

In [11]:
#using multiple square brackets to get the last and email column
df[["last", "email"]]

      last                  email
0    Furry   dennisbija@gmail.com
1  Francis  mikefrancis@gmail.com
2     Kiky   alfredkiky@gmail.com

In [12]:
#getting a list of all the columns
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [13]:
#using the pandas built in iloc function to acess rows by integer location
df.iloc[0]

first                    Nate
last                    Furry
email    dennisbija@gmail.com
Name: 0, dtype: object

In [14]:
df

    first     last                  email
0    Nate    Furry   dennisbija@gmail.com
1    Mike  Francis  mikefrancis@gmail.com
2  Alfred     Kiky   alfredkiky@gmail.com

In [15]:
#Used to acess specific rows
df.loc[0]

first                    Nate
last                    Furry
email    dennisbija@gmail.com
Name: 0, dtype: object

In [16]:
#using square bracket to get all the rows under the email column
df['email']

0     dennisbija@gmail.com
1    mikefrancis@gmail.com
2     alfredkiky@gmail.com
Name: email, dtype: object

In [17]:
#using the pandas built in set_index function to reset the index number and the implace=True to make the change permanently
df.set_index("email",inplace=True)

In [18]:
#using the loc function to acess data under a specific email adress
df.loc["dennisbija@gmail.com"]

first     Nate
last     Furry
Name: dennisbija@gmail.com, dtype: object

In [19]:
#using the loc function to acess data under a specific email adress
df.iloc[0]

first     Nate
last     Furry
Name: dennisbija@gmail.com, dtype: object

In [20]:
#reseting the index back to the defult one
df.reset_index(inplace=True)

In [21]:
df

                   email   first     last
0   dennisbija@gmail.com    Nate    Furry
1  mikefrancis@gmail.com    Mike  Francis
2   alfredkiky@gmail.com  Alfred     Kiky

In [22]:
#acessing a specific row and columns
df.loc[0:2,'email':"first"]

                   email   first
0   dennisbija@gmail.com    Nate
1  mikefrancis@gmail.com    Mike
2   alfredkiky@gmail.com  Alfred

In [23]:
#creating a variable and use it to filter out names with that last name and starting with that first name
filt = (df['last'] == 'Furry') | (df['first']=='Mike')

In [24]:
#using th loc function to acess the filter variable
df.loc[filt]

                   email first     last
0   dennisbija@gmail.com  Nate    Furry
1  mikefrancis@gmail.com  Mike  Francis

In [25]:
#acessing a range of rows and coulmns
df.loc[0:2, 'email':'first']

                   email   first
0   dennisbija@gmail.com    Nate
1  mikefrancis@gmail.com    Mike
2   alfredkiky@gmail.com  Alfred

In [26]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [27]:
#creating a list of columns and assigning it to a variable to update the coulmns
df.columns = ['email_adress', 'first_name','last_name']

In [28]:
df

            email_adress first_name last_name
0   dennisbija@gmail.com       Nate     Furry
1  mikefrancis@gmail.com       Mike   Francis
2   alfredkiky@gmail.com     Alfred      Kiky

In [29]:
#using list comprehension to turn the columns to upper case
df.columns = [x.upper()for x in df.columns] 
df

            EMAIL_ADRESS FIRST_NAME LAST_NAME
0   dennisbija@gmail.com       Nate     Furry
1  mikefrancis@gmail.com       Mike   Francis
2   alfredkiky@gmail.com     Alfred      Kiky

In [30]:
#using the string method to edit columns
df.columns = df.columns.str.replace(' ','_')
df

            EMAIL_ADRESS FIRST_NAME LAST_NAME
0   dennisbija@gmail.com       Nate     Furry
1  mikefrancis@gmail.com       Mike   Francis
2   alfredkiky@gmail.com     Alfred      Kiky

In [31]:
#using the remane function in pandas to remane specific columns
df.rename(columns={'FIRST_NAME' : 'First', 'LAST_NAME' : 'Last'}, inplace=True)

In [32]:
df

            EMAIL_ADRESS   First     Last
0   dennisbija@gmail.com    Nate    Furry
1  mikefrancis@gmail.com    Mike  Francis
2   alfredkiky@gmail.com  Alfred     Kiky

In [33]:
#using the remane function in pandas to remane specific columns
df.rename(columns={'FIRST_NAME' : 'First', 'LAST_NAME' : 'Last'}, inplace=True)

In [34]:
df

            EMAIL_ADRESS   First     Last
0   dennisbija@gmail.com    Nate    Furry
1  mikefrancis@gmail.com    Mike  Francis
2   alfredkiky@gmail.com  Alfred     Kiky

In [35]:
df.rename(columns={'LAST':'Last'}, inplace = True)

In [36]:
df

            EMAIL_ADRESS   First     Last
0   dennisbija@gmail.com    Nate    Furry
1  mikefrancis@gmail.com    Mike  Francis
2   alfredkiky@gmail.com  Alfred     Kiky

In [37]:
#renaming a specific column  by using lists
df.loc[2] = ['alfredjagaba@gmail.com','Afred','Jagaba']

In [38]:
#renaming a specific column  using lists
df.loc[2, ['Last', 'EMAIL_ADRESS']] = ['Kiky', 'alfredkiky@gmail.com']

In [39]:
df

            EMAIL_ADRESS  First     Last
0   dennisbija@gmail.com   Nate    Furry
1  mikefrancis@gmail.com   Mike  Francis
2   alfredkiky@gmail.com  Afred     Kiky

In [40]:
#changing a specific row without using a list
df.loc[2, 'Last'] = 'Jagaba'

In [41]:
df

            EMAIL_ADRESS  First     Last
0   dennisbija@gmail.com   Nate    Furry
1  mikefrancis@gmail.com   Mike  Francis
2   alfredkiky@gmail.com  Afred   Jagaba

In [42]:
#changing a specific row without using a list and using the at function
df.at[2, 'Last'] = 'Kiky'

In [43]:
#using filter to get th column we want
filt = (df['EMAIL_ADRESS'] == 'alfredkiky@gmail.com' )
df[filt]['Last']

2    Kiky
Name: Last, dtype: object

In [44]:
#using filter and loc to chage a name
filt = (df['EMAIL_ADRESS'] == 'alfredkiky@gmail.com' )
df.loc[filt, 'Last'] = 'Jagaba'

In [45]:
#using the str.upper method to change rows to uppercase
df['EMAIL_ADRESS'] = df['EMAIL_ADRESS'].str.upper()

In [46]:
#using the str.lower() method to change rows to lowercase
df['EMAIL_ADRESS'] = df['EMAIL_ADRESS'].str.lower()

In [47]:
df

            EMAIL_ADRESS  First     Last
0   dennisbija@gmail.com   Nate    Furry
1  mikefrancis@gmail.com   Mike  Francis
2   alfredkiky@gmail.com  Afred   Jagaba

In [48]:
#using the pandas built in.apply() to call the len function
#the .apply is used to call an already made function we see that in the next example
df['EMAIL_ADRESS'].apply(len)

0    20
1    21
2    20
Name: EMAIL_ADRESS, dtype: int64

In [49]:
def update_email(email):
    return email.upper()

In [50]:
df['EMAIL_ADRESS'].apply(update_email)

0     DENNISBIJA@GMAIL.COM
1    MIKEFRANCIS@GMAIL.COM
2     ALFREDKIKY@GMAIL.COM
Name: EMAIL_ADRESS, dtype: object

In [51]:
df['EMAIL_ADRESS'] = df['EMAIL_ADRESS'].apply(update_email)

In [52]:
df

            EMAIL_ADRESS  First     Last
0   DENNISBIJA@GMAIL.COM   Nate    Furry
1  MIKEFRANCIS@GMAIL.COM   Mike  Francis
2   ALFREDKIKY@GMAIL.COM  Afred   Jagaba

In [53]:
#using the built in lambda function
df['EMAIL_ADRESS'] = df['EMAIL_ADRESS'].apply(lambda x:x.lower())

In [54]:
df

            EMAIL_ADRESS  First     Last
0   dennisbija@gmail.com   Nate    Furry
1  mikefrancis@gmail.com   Mike  Francis
2   alfredkiky@gmail.com  Afred   Jagaba

In [55]:
#using the pandas built in.apply() to call the len function
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [56]:
#using  the len function
len(df['Last'])

3

In [57]:
#using the built in pandas function to call the values alphabetically
df.apply(pd.Series.min)

EMAIL_ADRESS    alfredkiky@gmail.com
First                          Afred
Last                         Francis
dtype: object

In [58]:
#using the built in pandas function to call the values alphabetically
df.apply(lambda x: x.min())

EMAIL_ADRESS    alfredkiky@gmail.com
First                          Afred
Last                         Francis
dtype: object

In [59]:
#using the pandas built in.applymap() to call the len function. the difference between the apply() and the applymap()is that the apply() works with series only while the appy map works with the whole data frame
df.applymap(len)

   EMAIL_ADRESS  First  Last
0            20      4     5
1            21      4     7
2            20      5     6

In [60]:
#using the pandas built in.applymap() to call the str method for converting all the values to lower
df.applymap(str.lower)

            EMAIL_ADRESS  First     Last
0   dennisbija@gmail.com   nate    furry
1  mikefrancis@gmail.com   mike  francis
2   alfredkiky@gmail.com  afred   jagaba

In [61]:
#using the builtin map method to replace values in a series the map method only works with series
df['First'].map({'Nate':'Dennis', 'Mike': 'Micheal'})

0     Dennis
1    Micheal
2        NaN
Name: First, dtype: object

In [62]:
#using the builtin map method to replace values in a series 
df['First'].replace({'Nate':'Dennis', 'Mike': 'Micheal'})

0     Dennis
1    Micheal
2      Afred
Name: First, dtype: object

In [63]:
#adding rows and columns
df['Full_Name'] = df ['First'] + ' ' + df['Last']

In [64]:
df

            EMAIL_ADRESS  First     Last     Full_Name
0   dennisbija@gmail.com   Nate    Furry    Nate Furry
1  mikefrancis@gmail.com   Mike  Francis  Mike Francis
2   alfredkiky@gmail.com  Afred   Jagaba  Afred Jagaba

In [65]:
#removing columns
df.drop(columns = ['First','Last'], inplace=True)

In [66]:
#using the spilt ton split the full name into first and last
df['Full_Name'].str.split(' ', expand = True)

       0        1
0   Nate    Furry
1   Mike  Francis
2  Afred   Jagaba

In [67]:
#spliting the first and the last column and assigning them to a seprate fullname column
df[['first', 'last']] = df['Full_Name'].str.split(' ', expand = True)

In [68]:
#adding rows and column to our dataframe
df.append({'first' : 'Daniel'}, ignore_index=True)

C:\Users\USER\AppData\Local\Temp\ipykernel_13700\2394211687.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first' : 'Daniel'}, ignore_index=True)

            EMAIL_ADRESS     Full_Name   first     last
0   dennisbija@gmail.com    Nate Furry    Nate    Furry
1  mikefrancis@gmail.com  Mike Francis    Mike  Francis
2   alfredkiky@gmail.com  Afred Jagaba   Afred   Jagaba
3                    NaN           NaN  Daniel      NaN

In [94]:
#creating a list of friends with email
people = {
    'first' : ['Daniel','Matthew'],
    'last'  : ['Emeka','Bijah'],
    'email' : ['daniel@gmail.com','matthew@gmail.com']
}

In [97]:
#using pandas to convert the table to dataframe
df2 = pd.DataFrame(people)

In [72]:
#adding the new dictionary together with the old one
df.append(df2, ignore_index=True, sort = False)

C:\Users\USER\AppData\Local\Temp\ipykernel_13700\2864212717.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort = False)

            EMAIL_ADRESS     Full_Name    first     last              email
0   dennisbija@gmail.com    Nate Furry     Nate    Furry                NaN
1  mikefrancis@gmail.com  Mike Francis     Mike  Francis                NaN
2   alfredkiky@gmail.com  Afred Jagaba    Afred   Jagaba                NaN
3                    NaN           NaN   Daniel    Emeka   daniel@gmail.com
4                    NaN           NaN  Matthew    Bijah  matthew@gmail.com

In [73]:
df = df.append(df2, ignore_index=True, sort = False)

C:\Users\USER\AppData\Local\Temp\ipykernel_13700\2517880801.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort = False)

In [74]:
df

            EMAIL_ADRESS     Full_Name    first     last              email
0   dennisbija@gmail.com    Nate Furry     Nate    Furry                NaN
1  mikefrancis@gmail.com  Mike Francis     Mike  Francis                NaN
2   alfredkiky@gmail.com  Afred Jagaba    Afred   Jagaba                NaN
3                    NaN           NaN   Daniel    Emeka   daniel@gmail.com
4                    NaN           NaN  Matthew    Bijah  matthew@gmail.com

In [75]:
#deleting the row with the index number 3
df.drop(index = 3)

            EMAIL_ADRESS     Full_Name    first     last              email
0   dennisbija@gmail.com    Nate Furry     Nate    Furry                NaN
1  mikefrancis@gmail.com  Mike Francis     Mike  Francis                NaN
2   alfredkiky@gmail.com  Afred Jagaba    Afred   Jagaba                NaN
4                    NaN           NaN  Matthew    Bijah  matthew@gmail.com

In [76]:
#sorting values by the first and last name in descending order
df.sort_values (by=['first',"last"],ascending=False )

            EMAIL_ADRESS     Full_Name    first     last              email
0   dennisbija@gmail.com    Nate Furry     Nate    Furry                NaN
1  mikefrancis@gmail.com  Mike Francis     Mike  Francis                NaN
4                    NaN           NaN  Matthew    Bijah  matthew@gmail.com
3                    NaN           NaN   Daniel    Emeka   daniel@gmail.com
2   alfredkiky@gmail.com  Afred Jagaba    Afred   Jagaba                NaN

In [77]:
df

            EMAIL_ADRESS     Full_Name    first     last              email
0   dennisbija@gmail.com    Nate Furry     Nate    Furry                NaN
1  mikefrancis@gmail.com  Mike Francis     Mike  Francis                NaN
2   alfredkiky@gmail.com  Afred Jagaba    Afred   Jagaba                NaN
3                    NaN           NaN   Daniel    Emeka   daniel@gmail.com
4                    NaN           NaN  Matthew    Bijah  matthew@gmail.com